html/20231128T132126--django-reduce-number-of-queries-to-db__django_sql.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-12-16 Sat 18:03 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>django reduce number of queries to db</title>
<meta name="author" content="Arvydas G." />
<meta name="description" content="welcome to my site" />
<meta name="keywords" content="emacs antanas geles" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="../static/style.css" type="text/css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="sitemap.html"> HOME </a>
</div><div id="preamble" class="status">
<div id="created">Page creation date(kodel 3
	 skirtingos datos???): 2023-12-15 Fri 05:12</div>
</div>
<div id="content" class="content">
<header>
<h1 class="title">django reduce number of queries to db</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org1a54f91">1. DjangoCon Europe 2023 | Squeezing Django performance for 14.9 million users on WhatsApp</a></li>
</ul>
</div>
</nav>

<div id="outline-container-org1a54f91" class="outline-2">
<h2 id="org1a54f91"><span class="section-number-2">1.</span> <a href="#org1a54f91">DjangoCon Europe 2023 | Squeezing Django performance for 14.9 million users on WhatsApp</a></h2>
<div class="outline-text-2" id="text-1">
<p>
Watched on <span class="timestamp-wrapper"><span class="timestamp">[2023-11-09 Thu]</span></span>
</p>

<p>
<a href="https://www.youtube.com/watch?v=A_bkbAv9TQs&amp;ab_channel=DjangoConEurope">https://www.youtube.com/watch?v=A_bkbAv9TQs&amp;ab_channel=DjangoConEurope</a>
</p>

<p>
Reduce the number of queries happening to the db.
</p>

<p>
asertNumQueries - make sure the queries do not exceed the limit that
you have set. 20:39. Labai geras dalykas manau. Testa toki pasikurti.
Kad dalykai letai neloadintu.
</p>

<p>
<code>log_min_duration_statement</code> - postgress db will LOG any queries that take
longer than you want.
</p>

<p>
locust for measuring performance. Specify how many users you want to
make how many requests per second.
</p>

<p>
faker to fake data and not use production data.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Arvydas G. (<a href="mailto:arvydas.gaspa@gmail.com">arvydas.gaspa@gmail.com</a>)</p>
<p class="date">Date: 2023-11-28 Tue 13:21</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.1 (<a href="https://orgmode.org">Org</a> mode 9.6.6)</p>
<p class="validation"></p>
</div>
<script>window.klipse_settings = {selector_eval_html: '.src-html',
                             selector_eval_js: '.src-js',
                             selector_eval_python_client: '.src-python',
                             selector_eval_scheme: '.src-scheme',
                             selector: '.src-clojure',
                             selector_eval_ruby: '.src-ruby'};</script><script src="https://storage.googleapis.com/app.klipse.tech/plugin_prod/js/klipse_plugin.min.js"></script><link rel="stylesheet" type="text/css" href="https://storage.googleapis.com/app.klipse.tech/css/codemirror.css"/></body>
</html>